"""
- 타일 채우기
추가 되는 패턴을 파악해야 함
"""
N = int(input())
n = N // 2

dp = [1 for _ in range(n + 1)]
if N != 1:
    dp[1] = 3

if N % 2:
    ans = 0
else:
    for i in range(2, n + 1):
        dp[i] = dp[i - 1] * 3 + 2
        for j in range(1, i - 1):
            dp[i] += dp[j] * 2
    ans = dp[n]

print(ans)

"""
 ----------------------            --------------------
|      |              |           |             |      |
|      |              |           |             |      |
        --------------    . . .   --------------
|      |              |           |             |      |
|      |              |           |             |      |
 ----------------------            --------------------
|              |          . . .         |              |
|              |                        |              |
 --------------                          --------------
이런 모양이 2개씩 늘어남
"""
