"""
- 테트로미노
완전탐색 문제!
"""
import sys

input = sys.stdin.readline
N, M = map(int, input().split())

arr = []

for _ in range(N):
    arr.append(list(map(int, input().split())))

tetro = [
    [[0, 1], [0, 2], [0, 3]],
    [[1, 0], [2, 0], [3, 0]],
    [[0, 1], [1, 0], [1, 1]],
    [[1, 0], [2, 0], [2, 1]],
    [[1, 0], [2, 0], [2, -1]],
    [[0, 1], [0, 2], [-1, 2]],
    [[0, 1], [0, 2], [1, 2]],
    [[0, -1], [1, 0], [2, 0]],
    [[0, 1], [1, 0], [2, 0]],
    [[1, 0], [0, 1], [0, 2]],
    [[1, 0], [1, 1], [1, 2]],
    [[1, 0], [1, 1], [2, 1]],
    [[0, 1], [-1, 1], [-1, 2]],
    [[0, 1], [1, 1], [1, 2]],
    [[1, 0], [1, -1], [2, -1]],
    [[1, 0], [0, 1], [-1, 0]],
    [[1, 0], [0, 1], [0, -1]],
    [[1, 0], [-1, 0], [0, -1]],
    [[0, 1], [-1, 0], [0, -1]],
]

ans = 0

for i in range(N):
    for j in range(M):
        for t in tetro:
            try:
                sum_n = (
                    arr[i][j]
                    + arr[i + t[0][0]][j + t[0][1]]
                    + arr[i + t[1][0]][j + t[1][1]]
                    + arr[i + t[2][0]][j + t[2][1]]
                )
            except IndexError:
                sum_n = 0
            ans = ans if ans > sum_n else sum_n

print(ans)
